Repository: Kaaanyildiz/Flutter_Puzzle_Game
Catalog: lib/l10n/app_*.arb
Languages: tr

# easyLevel
source: Easy
tr: Kolay

# mediumLevel
source: Medium
tr: Orta

# hardLevel
source: Hard
tr: Zor

# startButton
source: Play
tr: Başla

source: How to Play?
tr: Nasıl Oynanır?

# subtitle
source: Assemble the Pieces, Exercise Your Mind!
tr: Parçaları Birleştir, Zihni Çalıştır!

source: Difficulty Level
tr: Zorluk Seviyesi

# timeElapsed
source: Time: {time}
tr: Süre: {time}

# moves
source: Moves: {moveCount}
tr: Hamle: {moveCount}

source: Congratulations!
tr: Tebrikler!

# completedIn
source: You completed the puzzle in {time}
tr: Bulmacayı {time} içinde tamamladınız

# withMoves
source: with {moveCount} moves
tr: {moveCount} hamle ile

source: Restart
tr: Yeniden Başlat

source: Main Menu
tr: Ana Menü

source: Next Level
tr: Sonraki Seviye

source: Pause
tr: Duraklat

source: Resume
tr: Devam Et

source: Quit
tr: Çık

# tutorialTitle
source: How to Play
tr: Nasıl Oynanır

# tutorialStep1
source: Tap on a tile to move it into an empty space.
tr: Bir kareyi boş alana taşımak için üzerine dokun.

# tutorialStep2
source: Arrange all tiles in the correct order to complete the puzzle.
tr: Tüm kareleri doğru sırada yerleştirerek bulmacayı tamamla.

# tutorialStep3
source: Use fewer moves and finish faster for a better score!
tr: Daha az hamle kullanarak ve daha hızlı bitirerek daha iyi puan al!

source: Get Started
tr: Başla

source: Tips and Strategies
tr: İpuçları ve Stratejiler

# skillsDevelopment
source: This game develops the following skills:
tr: Bu oyun şu becerileri geliştirir:

# visualPerception
source: Visual perception and attention
tr: Görsel algı ve dikkat

# problemSolving
source: Problem solving skills
tr: Problem çözme becerisi

source: Logical thinking
tr: Mantıksal düşünme

# patienceConcentration
source: Patience and concentration
tr: Sabır ve konsantrasyon

# shuffledPuzzle
source: 1. Shuffled Puzzle
tr: 1. Karıştırılmış Puzzle

# shuffledPuzzleDesc
source: When the game starts, you'll see puzzle pieces in a scrambled state.
tr: Oyun başladığında, karışık durumdaki puzzle parçalarını görürsünüz.

# movingPieces
source: 2. Moving Pieces
tr: 2. Parçaları Taşıma

# movingPiecesDesc
source: You can move pieces by tapping on them if they are adjacent to the empty space. Only pieces neighboring the empty space can be moved.
tr: Boş alanın yanındaki parçalara dokunarak onları boş alana taşıyabilirsiniz. Sadece boş alanın komşusu olan parçaları hareket ettirebilirsiniz.

# gameGoal
source: 3. Game Goal
tr: 3. Oyunun Hedefi

# gameGoalDesc
source: Try to place all pieces in the correct order. You complete the game when the pieces are arranged sequentially.
tr: Tüm parçaları doğru sırayla yerleştirmeye çalışın. Parçalar sıralı şekilde dizildiğinde oyunu tamamlamış olursunuz.

# gameComplete
source: The game is complete when all pieces are placed correctly!
tr: Tüm parçalar doğru yerleştiğinde oyun tamamlanır!

# cornersTip
source: Start with corners
tr: Köşelerden başlayın

# cornersTipDesc
source: First place the corner pieces in their correct positions.
tr: Öncelikle köşe parçalarını doğru yerlerine yerleştirin.

# topRowTip
source: Complete the top row
tr: Üst satırı tamamlayın

# topRowTipDesc
source: After placing the corners, continue by completing the top row.
tr: Köşeleri yerleştirdikten sonra, üst satırı tamamlayarak devam edin.

# leftColumnTip
source: Complete the left column
tr: Sol sütunu tamamlayın

# leftColumnTipDesc
source: After completing the top row, proceed by placing the left column.
tr: Üst satırı tamamladıktan sonra, sol sütunu yerleştirerek ilerleyin.

# patienceTip
source: Be patient
tr: Sabırlı olun

# patienceTipDesc
source: Sometimes you may need to temporarily displace some pieces to place another one.
tr: Bazen bir parçayı yerleştirmek için diğer parçaları geçici olarak yerinden çıkarmanız gerekebilir.

# moveForward
source: Forward
tr: İleri

# moveBack
source: Back
tr: Geri

source: Move Planning
tr: Hamle Planlama

# movePlanningDesc
source: A good puzzle solver plans their moves in advance. Think about the sequence of moves needed before placing a piece.
tr: İyi bir puzzle çözücü, hamleleri önceden planlar. Bir parçayı yerine koymadan önce, bunun için gereken hamle dizisini düşünün.

source: Advanced Thinking
tr: İleri Düşünme

# advancedThinkingDesc
source: By thinking about a series of moves rather than a single move, you can solve complex situations.
tr: Tek bir hamle değil, bir dizi hamle düşünerek karmaşık durumları çözebilirsiniz.

source: Useful Techniques
tr: Yararlı Teknikler

# techniqueHeader
source: Technique
tr: Teknik

# descriptionHeader
source: Description
tr: Açıklama

# moveTile
source: Moving a tile
tr: Parçayı taşıma

# moveTileDesc
source: Move by tapping on pieces around the empty space
tr: Boş alan etrafındaki parçalara dokunarak taşıma

source: Cycle movement
tr: Döngü hareketi

# cycleMovementDesc
source: Arrange pieces by moving them in a cyclic pattern
tr: Parçaları döngüsel olarak hareket ettirerek düzenleme

# tempDisplacement
source: Temporary displacement
tr: Geçici yer değiştirme

# tempDisplacementDesc
source: Temporarily place a piece in the wrong position
tr: Bir parçayı geçici olarak yanlış yere koyma

# stuckTip
source: When stuck, sometimes taking a step back helps you see the way forward.
tr: Takıldığınızda bazen bir adım geri gitmek, ileriyi görmek için yardımcı olabilir.

source: Difficulty Levels
tr: Zorluk Seviyeleri

# easyDifficulty
source: Easy
tr: Kolay

# easyDifficultyDesc
source: 3x3 puzzle layout (9 pieces)
tr: 3x3 puzzle düzeni (9 parça)

# easyFeature1
source: Easier solution with fewer pieces
tr: Daha az parça ile kolay çözüm

# easyFeature2
source: Ideal for beginners
tr: Başlangıç seviyesi için idealdir

# easyFeature3
source: Perfect for learning basic strategies
tr: Temel stratejileri öğrenmek için mükemmel

# easyFeature4
source: Unlimited moves
tr: Sınırsız hamle hakkı

# mediumDifficulty
source: Medium
tr: Orta

# mediumDifficultyDesc
source: 4x4 puzzle layout (16 pieces)
tr: 4x4 puzzle düzeni (16 parça)

# mediumFeature1
source: Medium difficulty level
tr: Orta zorluk seviyesi

# mediumFeature2
source: Requires more thinking
tr: Daha fazla düşünme gerektirir

# mediumFeature3
source: Ideal for developing cognitive skills
tr: Bilişsel becerileri geliştirmek için ideal

# mediumFeature4
source: Requires good strategy
tr: İyi strateji gerektirir

# hardDifficulty
source: Hard
tr: Zor

# hardDifficultyDesc
source: 5x5 puzzle layout (25 pieces)
tr: 5x5 puzzle düzeni (25 parça)

# hardFeature1
source: High difficulty level
tr: Yüksek zorluk seviyesi

# hardFeature2
source: Requires more complex solution strategies
tr: Daha karmaşık çözüm stratejileri gerektirir

# hardFeature3
source: A perfect challenge for experienced players
tr: Deneyimli oyuncular için mükemmel bir meydan okuma

# hardFeature4
source: Requires intense thinking and planning
tr: Yoğun düşünme ve planlama gerektirir

# puzzleBenefits
source: Puzzle games are a perfect way to have fun while improving your mental skills.
tr: Puzzle oyunu, zihinsel becerilerinizi geliştirirken eğlenmek için mükemmel bir yoldur.

# readyToSolve
source: Ready to solve puzzles?
tr: Puzzle çözmeye hazır mısınız?
